~Cases/SpeciesTransport/simpleMixing/Transient_Mixing_chtMultiRegionFoam/0.orig/fluid_0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    inlet_air
    {
        type            fixedValue;
        value           uniform 300;
    }
    inlet_top
    {
        type            fixedValue;
        value           uniform 300;
    }
    
    inlet_bottom
    {
	type		zeroGradient;
    }
    
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           $internalField;
    }

    "wall.*"
    {
	type		zeroGradient;
    }	

    symmetry
    {
	type            symmetry;  
    }

    "proc.*"
    {
        type            processor;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
	
}


// ************************************************************************* //
