~Cases/SpeciesTransport/simpleMixing/Transient_Mixing_chtMultiRegionFoam/0.orig/fluid_0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.45 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    
    inlet_air
    {
        type            surfaceNormalFixedValue;
        refValue        uniform -0.45;      
    }
	
    inlet_top
    {
        type            surfaceNormalFixedValue;
        refValue        uniform -4.566;      
    }

    inlet_bottom
    {
        type            noSlip;     
    }

    outlet
    {
	    type            pressureInletOutletVelocity;
	    value	    uniform (1 0 0);  
    }

    "wall.*"
    {
        type            noSlip;
    }

    "proc.*"
    {
        type            processor;
    }

    symmetry
    {
	type            symmetry;  
    }
    
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
