~Cases/SpeciesTransport/simpleMixing/Transient_Mixing_chtMultiRegionFoam/0.orig/fluid_0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    
    inlet_air
    {
        type            calculated;
        value           $internalField;
    }

    inlet_top
    {
        type            calculated;
        value           $internalField;
    }

    inlet_bottom
    {
        type            compressible::alphatWallFunction;
	    value		$internalField;
    }

    outlet
    {
        type            calculated;
        value           $internalField;
    }

    "wall.*"
    {
        type            compressible::alphatWallFunction;
	    value		$internalField;
    } 

    "proc.*"
    {
        type            processor;
    }
    frontAndBackPlanes
    {
        type            empty;
    }

    symmetry
    {
	type            symmetry;  
    }

}


// ************************************************************************* //
