~Cases/SpeciesTransport/simpleMixing/Transient_Mixing_chtMultiRegionFoam/0.orig/fluid_0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    ".*"
    {
        type            fixedFluxPressure;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    frontAndBackPlanes
    {
        type            empty;
    }

    "proc.*"
    {
        type            processor;
    }
    
    symmetry
    {
	type            symmetry;  
    }
}


// ************************************************************************* //
