~Cases/SpeciesTransport/simpleMixing/Transient_Mixing_chtMultiRegionFoam/system/fluid_0/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0.01;
    }

    rhoFinal
    {
        $rho;
        tolerance       1e-7;
        relTol          0;
    }

    p_rgh
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        smoother         GaussSeidel;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance        1e-7;
        relTol           0;
    }

    "(U|h|k|omega|R|Yi|epsilon)"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-7;
        relTol           0.1;
    }

    "(U|h|k|omega|R|Yi|epsilon)Final"
    {
        $U;
        tolerance        1e-7;
        relTol           0;
    }
    
    G
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0.1;
    }

    GFinal
    {
        $G;
        relTol          0.1;
    }

    Ii
    {
        solver                  GAMG;
        tolerance               1e-4;
        relTol                  0;
        smoother                symGaussSeidel;
        cacheAgglomeration      true;
        nCellsInCoarsestLevel   10;
        agglomerator            faceAreaPair;
        mergeLevels             1;
        maxIter                 1;
    }

}

PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors    2; //1
    nCorrectors         5; //3
    nNonOrthogonalCorrectors 2; //1
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    equations
    {
        "h.*"           0.8;
        "U.*"           0.6;
	"Yi.*"		0.6;
    }
}

// ************************************************************************* //
